[
  {
    "path": "posts/2021-01-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This post will be looking at Chart 6 Resident labour force by age in MOM's [Report: Labour Force in Singapore 2019](https://stats.mom.gov.sg/Pages/Labour-Force-In-Singapore-2019.aspx) and seeing if there are possible areas for improvement.",
    "author": [
      {
        "name": "Amos Lau",
        "url": "https://bochup.work"
      }
    ],
    "date": "2021-01-22",
    "categories": [],
    "contents": "\r\nIntroduction\r\nTask\r\nCritic\r\n\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\n\r\nIn terms of clarity, the following areas could be improved:\r\nThe statement above the graph uses age ranges like 55 & over and 25 to 54. However, the graph itself uses a more granular age range. This may be result in viewers having difficult to relate to the statement.\r\nThe statement above the graph refers to the Labour Force Participation Rate (LFPR), but this data is not captured within the graph. This may be confusing to the viewer as they may think the chart represents LFPR.\r\nThe line chart used may not be the best representation for the data as lines are usually used when dealing with continuous data to indicate changes or trends. Since the data presented is of categorical data, it may make more sense to use an alternative representation like a bar chart.\r\nThe lines that show the Median Age for both June 2009 and June 2019 is an attempt to show the relative position of the median. For example, the line for the median age for June 2009 is 1/4 way between the tick marks of 40-44. However, this may confuse the viewers as the x-axis is not meant to be continuous.\r\nIn terms of aesthetics, the following areas could be improved:\r\nThere is no y-axis for the graph, making it difficult for the viewer to know the value of the points.\r\nThe table below is a waste of ink as it is visually difficult for a viewer to compare the numbers.\r\nThe chart title is generic and could be changed to something more impactful so the viewer knows what is the message we want to convey.\r\nSketch of Proposed Design\r\n\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. The proposed alternative data visualisation must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\n\r\nThe following is a sketch of the proposed design.\r\nProposed Data Visualisation\r\n\r\nUsing Tableau, design the proposed data visualisation.\r\n\r\nThe proposed data visualisation can be found at…\r\nStep-by-step Description\r\n\r\nProvide step-by-step description on how the data visualisation was prepared.\r\n\r\nThe following are sections describe how the data visualisation was prepared.\r\nData preparation\r\nThe data used for the visualisations were gotten the Ministry of Manpower’s website at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx. Specifically, Table 5 Resident Labour Force Participation Rate by Age and Sex, 2009 – 2019 (June) and Table 7 Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 – 2019 (June) were used for our data visualisation.\r\nScreenshot of Table 5 download from MOM’s websiteThe data file was in Excel format, but had to be cleaned in Excel by removing the extra columns and excess rows. Both the files were then merged into a single csv file, with an additional column indicating the type where LFPR refers to the Labour Force Participation Rate and RLF refers to the Resident Labour Force:\r\nScreenshot of csv fileNext, the data was loaded into Tableau Prep Builder for further preparation.\r\nThe data was first pivoted to convert the individual year columns into a single column:\r\nIndividual year columns were pivoted and the resulting columns were named as Year and ValueNext, the data was unpivoted from the Data and Value columns to get 2 columns for LFPR and RLF:\r\nUnpivot dataA calculated field was created to get the Residents Outside Labour Force (ROLF):\r\n[RLF]/[LFPR]*(100-[LFPR])\r\nThe column on LFPR was no longer required and was deleted.\r\nNext, the table was pivoted on the RLF and ROLF columns and given meaningful names.\r\nPivot RLF and ROLF columnsFinally, the prepared data was saved for further use in Tableau:\r\nOutput data for use in TableauLoad Data\r\nThe prepared data was loaded in Tableau:\r\nData was loaded in TableauThe Age Group column was renamed to Age Group (Original). The renaming was done such that we can group this column to aggregate the data further. This will be elaborated on later.\r\nThe Year column was renamed to Date and a calculated field was calculated to extract the year as a numerical value:\r\nCreation of Year ColumnComparison of 2009 and 2019’s Population and Labour Breakdown\r\nWe first create a new Tableau worksheet to compare the population and labour breakdown of 2009 and 2019. The following steps were done to create the worksheet:\r\nDrag the Residents (Thousands) measure to the Column shelf.\r\nDrag the Age Group (Original) dimension to the Row shelf.\r\nWe further aggregate the data by grouping the age groups into 3 groups - 15 - 24, 25 - 55, and 55 & Over.\r\nFurther aggregate the Age Groups\r\nWe add the Year field into the Rows shelf after the Age Group field. Next, we change the year field to a Dimension instead of a Measure, and for it to be a discrete dimension since we only want to compare 2009 and 2019.\r\nWe add the Year field into the filter, make it into a Discrete Dimension, and filter the years 2009 and 2019.\r\nWe drag Age Group to the Colour icon to colour the bar charts by the different age groups.\r\nWe drag Type to the Detail icon, and change Detail to Colour in order to further colour the age groups by the Resident Labour Force (RLF) and the Residents Outside of Labour Force (ROLF).\r\nWe drag Resident (Thousands) to the Label icon to add a Label on the bar charts. We want to display the percentage breakdown of RLF and ROLF and so we use a “Percent of Total” quick table calculation. The calculation was computed using “Table (Across)”.\r\nWe sort according to Age Group (older groups on top) and Year (2019 on top).\r\nWe change the colour of the items, using 3 distinct colours for each age group and lighter and darker shades to differentiate the RLF and ROLF.\r\nLegend Colours\r\nWe resize the chart to make the bars thicker.\r\nWe annotate the chart to provide our insights.\r\nWe provide meaningful titles to the chart and the legend.\r\nThe final product of the worksheet is as follows:\r\nFinal Product of WorksheetComparing Breakdown of Labour Force by Age Group from 2009 to 2019\r\nNext we create a worksheet to compare the breakdown of labour force from 2009 to 2019. The following steps were done to create the worksheet:\r\nWe drag the Year field to the Columns shelf and change it to a discrete dimension.\r\nWe drag the Residents (Thousands) measure to the Rows shelf. As we want to show the % breakdown per year, we use a quick table calculation to calculate the % of total, computing it using Table (Down). We use the same column as the label for the bar graphs.\r\nWe drag the Type field to the Filters shelf. As we want to only show the breakdown for the labour force, we filter by RLF type.\r\nWe drag Age Group to the Colours icon to colour the bar charts by age group.\r\nWe sort the stacked bars by Age Group with the youngest being below and oldest on top.\r\nWe change the colours to make them consistent with our previous worksheet.\r\nWe annotate the chart to provide our insights.\r\nWe provide meaningful titles to the chart, y-axis and the legend.\r\nThe final product of the worksheet is as follows:\r\nBreakdown of Resident Labour Force from 2009 to 2019Combining it together into a Dashboard\r\nFinally, we create a Dashboard to combine both charts. The following steps were done to create the worksheet:\r\nDrag both worksheets into the dashboard area.\r\nWe add texts the top and bottom of the dashboard for the title, description of the message we want the viewer to take away, and the sources used for the charts.\r\nThe final product of the proposed visualisation in the form of a dashboard is as follows:\r\nFinal Product of Proposed VisualisationMajor Observations\r\n\r\nDescribe three major observations revealed by the data visualisation prepared.\r\n\r\nUsing the proposed data visualisation…\r\nConclusion\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T19:10:45+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Amos' Visual Analytics Blog",
    "description": "Welcome to my blog. This blog was started for my masters module on Visual Analytics, and will be updated as and when I find other interesting things to write on.",
    "author": [
      {
        "name": "Amos Lau",
        "url": "https://bochup.work"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-22T15:44:37+08:00",
    "input_file": {}
  }
]
