[
  {
    "path": "posts/2021-02-21-visual-analytics-project-proposal/",
    "title": "Visual Analytics Project Proposal",
    "description": "This post contains the proposal for our Visual Analytics Project titled VISTAS - Visualising Industry Skill TAlent Shifts.",
    "author": [
      {
        "name": "Amos Lau",
        "url": "https://www.linkedin.com/in/amos-lau/"
      },
      {
        "name": "Cheryl Pay",
        "url": {}
      },
      {
        "name": "Louis Chong",
        "url": {}
      }
    ],
    "date": "2021-02-21",
    "categories": [
      "Project"
    ],
    "contents": "\r\n1. Background\r\nThe LinkedIn and World Bank Group have partnered and released data from 2015 to 2019 that focuses on 100+ countries with at least 100,000 LinkedIn members each, distributed across 148 industries and 50,000 skill categories. This data aims to help government and researchers understand rapidly evolving labor markets with detailed and dynamic data (The World Bank Group, 2021).\r\nSimple data visualisations are also publicly available at https://linkedindata.worldbank.org/data. However, they are limited in the exploration of trends because they only allow one parameter of choice.\r\n2. Project Motivation\r\nThrough our project, we want to provide individuals and countries with insights into various interest areas to benchmark themselves against the global landscape. As an extension, we will be including macroeconomic indicators of GDP growth from World Bank Organization to our data visualisations. We envision our project to help answer the following questions:\r\nFor individuals:\r\nIncreasing employability - What are the highly sought-after skills to build up to increase employability in a particular country or a particular sector?\r\nEmployment opportunities - Which country holds better employment opportunities for certain skills or certain industry?\r\nMigration Trends - Which country are people e.g. fellow countrymen, migrating to?\r\nFor countries:\r\nMigration Trends - Where are our (country’s) talent migrating to?\r\nSkill Trends - What are the skills lost or gained in our country or in the sectors in our country?\r\nLearning from other countries - Which skills (i.e. top skill needs in each industry) do we encourage and train in our own people to increase the competitiveness of our labour market against other countries?\r\nSkill and Industry Trends - Are we losing or gaining the skills or industries we desire and according to plan? How do we change this, if required? \r\nOur final deliverable is to create a user-friendly, interactive dashboard that allows individuals and countries view their competitive advantage and understand evolving labour markets across the world in four areas: skills, occupations, migration and industries. Comparison will be allowed at both the country-level and industry-level.\r\n3. Limitations of our Project\r\nWe have identified two main limitations of our project which arise due to the LinkedIn dataset:\r\nOur data does not capture all the countries due to the penetration rate of LinkedIn; some countries do not use LinkedIn.\r\nOur data is not representative of the entire migration landscape as LinkedIn data has better coverage fo white-collar workers in knowledge-intensive sectors.\r\n4. Data Description\r\nOur proposed datasets for analyses will come mainly from the LinkedIn-World Bank partnership. We will complement it with other macroeconomic indicators such as GDP per capita from World Bank as well:\r\nhttps://linkedindata.worldbank.org/\r\nhttps://data.worldbank.org/indicator/NY.GDP.PCAP.CD\r\nThe LinkedIn-World Bank dataset comprises the following:\r\nIndustry Employment Growth: Growth rate of employment in each industry in each country from 2015-2019\r\n78 distinct industries\r\n\r\nTalent Migration: Growth in number of people with each skill in each country from 2015-2019\r\nIndustry Skills Need: Top 10 skills required in each industry from 2015-2019\r\nSkills Penetration: Penetration of each skill in each industry from 2015-2019\r\nThe GDP per capita dataset comprises annual time-series GDP per capita (current USD) for countries.\r\n5. Proposed Visualisations\r\nThe following sections list down some questions that we hope our application will be able to help answer. We propose various visualisation techniques to help the user visualise the information in a user-friendly way.\r\n5.1 What are the desired skills required for each industry in each year?\r\nTop 10 Skills in IndustryDistribution of Skills by Skill CategoriesTop 10 Industries by Skill Groups5.2 Talent Migration: Which countries, industries and skills are gained and lost from 2015-2019?\r\nVisualising Migration by Country, Skill and IndustrySankey Diagram for Visualising MigrationChord Diagram for Visualising Migration5.3 Employment Growth vs Industry Migration (or Skill- Top 10 in industry)\r\nEmployment Growth vs Industry Migration5.4 Is there any correlation between industry employment growth and GDP growth?\r\nGDP Growth vs Employment Growth5.5 Which countries are similar to each other in terms of skills or growth?\r\nHierarchical Clustering of Countries6. Project Timeline\r\nThe following is the proposed project timeline:\r\nProject Timeline7. Software Tools & R Packages\r\nOur project will be done as an R Shiny application using RStudio as the IDE. We envision the use of the following packages:\r\nR Shiny – For creating an interactive R Shiny web-based application\r\nTidyverse – The tidyverse collection of apps will provide the foundational packages for our project. Some core uses of this collection will be for plotting (ggplot2), data cleaning and manipulation (dplyr, tidyr).\r\nnetworkD3 - For plotting sankey diagrams\r\ncirclize - For plotting chord diagrams\r\n8. Github Repository\r\nThe code for our project can be found at https://github.com/moomookau/VISTAS.\r\n9. Team Members\r\nAmos Lau\r\nCheryl Pay\r\nLouis Chong\r\n10. References\r\nDuca, D. (2019, July 9). Using LinkedIn for social research. Retrieved February 28, 2021, from https://blogs.lse.ac.uk/impactofsocialsciences/2019/07/09/using-linkedin-for-social-research/\r\nWorld talent migration trends. (2019, August 22). Retrieved February 28, 2021, from https://www.bayut.com/mybayut/world-talent-migration-trends/\r\nPeople on the move: Global migration’s impact and opportunity (2016, December). Retrieved February 28, 2021, from McKinsey Global Institute website: https://www.mckinsey.com/~/media/McKinsey/Industries/Public%20and%20Social%20Sector/Our%20Insights/Global%20migrations%20impact%20and%20opportunity/MGI-People-on-the-Move-Full-report.pdf\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-28T21:11:14+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-05-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "This post will be looking at two data visualisations created by a research scientist of a research team conducting a study to understand the willingness of the public to take COVID-19 vaccinations.",
    "author": [
      {
        "name": "Amos Lau",
        "url": "https://www.linkedin.com/in/amos-lau/"
      }
    ],
    "date": "2021-02-05",
    "categories": [
      "DataVizMakeover"
    ],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Task\r\n2.1 Critic\r\n2.2 Sketch of Proposed Design\r\n2.3 Proposed Data Visualisation\r\n2.4 Step-by-step Description\r\n2.4.1 Data preparation\r\n2.4.2 Load Data\r\n2.4.3 Creating Parameters\r\n2.4.4 Creating Fields for Percentage and Error Bars Visualisation\r\n2.4.5 Creating Fields for Divergent Stacked Bars Visualisation of Likert Scale Data\r\n2.4.5 Creating Survey Results Visualisation\r\n2.4.6 Creating Visualisation for further breakdown of results\r\n2.4.7 Creating Visualisation for Divergent Stacked Bars\r\n2.4.8 Combining it together into a Dashboard\r\n\r\n2.5 Major Observations\r\n\r\n3. Conclusion\r\n4. References\r\n\r\n1. Introduction\r\nThis post will be looking at the following data visualisations to identify possible areas of improvement. The data visualisations were created by a research scientist of a research team conducting study to understand the willingness of the public to take COVID-19 vaccinations.\r\nOriginal VisualisationsWe will also come up with a proposed design and implement it in tableau. Next, a step-by-step guide will be provided for coming up with the proposed design. Finally, we will list down major observations that we are able to derive from the proposed design.\r\n2. Task\r\nThe tasks can be summarised as follows:\r\nCritic the existing visualisation\r\nSketch a proposed design\r\nImplement the proposed design\r\nProvide steps for replication of the proposed design\r\nMajor observations derived from the proposed design\r\n2.1 Critic\r\n\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\n\r\nIn terms of clarity, the following areas could be improved:\r\nThere is no lead in paragraph for the visualisations, making it hard to determine what message is being conveyed to the viewer.\r\nThe title of the left visualisation is supposedly about whether a country is pro-vaccine. However, it only utilises responses for the question “If a Covid-19 vaccine were made available to me this week, I would definitely get it.” to draw this conclusion. There could be other factors which contribute to how people would respond to the question besides how pro-vaccine they are e.g. the prevalence of COVID-19 in a country, the attitude of the people to COVID-19, the standard of healthcare in a country.\r\nBoth the visualisations represent the results as a percentage of the total records for each country. However, the viewer is not able to tell how many total results there are and may not know how representative the results is of the country. For example, a graph of only 10 results will not be as good a representation of a population compared to a graph of 1000 results.\r\nThe two visualisations are not sorted consistently. The left visualisation is sorted by alphabetical order in terms of country, while the right one is sorted by the % of respondents who strongly agreed. This may be confusing to the viewer who may assume that both are sorted in the same way.\r\nThe left visualisation uses 100% stacked bars, but this may be difficult to compare results of different countries\r\nThe right visualisation only shows the proportion of users who strongly agreed. However, it may make more sense to show both those who scored 1 (strongly agree) and those who scored 2 if we want to convey the message of people who agree.\r\nThe source of the data was not provided and therefore the viewer may not know where the data was sourced from.\r\nIn terms of aesthetics, the following areas could be improved:\r\nThe left visualisation uses a five-colour scheme to colour the different values. However, there is no meaning to the colour scheme, and it would be better to use opposing colours for those that agree and those that disagree.\r\nThere is a typo error in the first visualisation, where pro-vaccine is wrongly spelled as “pro-vacinne”.\r\nThe viewer will not know what the legend title refers to as it is indicated as “Vac1”.\r\nThe formatting of the tick values in the x-axis is not consistent across both visualisations.\r\n2.2 Sketch of Proposed Design\r\n\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. The proposed alternative data visualisation must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\n\r\nThe following is a sketch of the proposed design:\r\nSketch of Proposed DesignThe proposed design comprises three visualisations and a panel with controls.\r\nThe visualisation in the top left shows the proportion of survey respondents who agree with a survey question by the various countries. It further includes the 95% and 99% error bars to show viewers the amount of uncertainty based on the number of survey respondents.\r\nThe visualisation in the bottom left shows the further breakdown of the survey results by various metrics such as Age, Gender, Household Size or number of Household Children.\r\nThe visualisation in the top right uses divergent stacked bars to present the survey data for each country.\r\nThe controls will allow the viewer to select the following:\r\nSurvey Question - This allows the user to select various questions related to vaccines for analysis, as opposed to using only one question to make a conclusion.\r\nShow Measures - This allows the user to select what elements to display on the charts, whether to include the actual percentage, the 95% error bars and/or the 99% error bars.\r\nAgree Calculation - This allows the user to choose which survey responses to include when showing the proportion of respondents who agree.\r\nBreakdown By - This allows the user to to further breakdown the results by Age, Gender, Household Size, or Household Children.\r\nSort By - This allows the user to sort either alphabetically by Country name or by the Value.\r\nSort Order - This allows the user to sort in an ascending or descending manner.\r\nThe proposed design improves on the original design on the following areas:\r\nThe controls allow the viewer to choose the survey question and the respective results. This lets the viewer know how people responded, rather than using only a single question to deem how pro-vaccine a country is.\r\nThe inclusion of error bars provides a better visualisation of the uncertainty around the results. For example, certain countries may have less results and thus there is more uncertainty in the results. Without showing this uncertainty, the viewer may assume that the results are representative of the population of the countries.\r\nThe second visualisation lets viewers drilldown into the results by more metrics. This allow further analysis of the data to see if there is difference when broken down. For example, we are able to tell how males and females responded.\r\nThe controls allow the viewer to sort the results in a meaningful way. Sorting by country allows consistent placement to compare across various survey questions, while sorting by value allows comparison on how the different countries responded to the surveys.\r\nDivergent stacked bars allow better comparison of Likert scale data as compared to the original.\r\n2.3 Proposed Data Visualisation\r\n\r\nUsing Tableau, design the proposed data visualisation.\r\n\r\nThe following is the proposed design for the data visualisation:\r\nProposed Data VisualisationThe proposed data visualisation has been uploaded to Tableau Public and can be found here.\r\n2.4 Step-by-step Description\r\n\r\nProvide step-by-step description on how the data visualisation was prepared.\r\n\r\nThe following sections describe how the data visualisation was prepared.\r\n2.4.1 Data preparation\r\nThe data used for the visualisations were gotten from the Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub. There was one data file for each country, and the data files had different times when they were last updated ranging from 5 months ago to few days ago. Only countries with data that was updated recently, i.e. in the last 2 weeks, were used for our visualisation. Israel was excluded as it was only added in February 2021. The final data included the following countries - Australia, Canada, Denmark, France, Germany, Italy, Japan, Netherlands, Norway, Singapore, South Korea, Spain, Sweden and the United Kingdom.\r\nTableau Prep Builder (TPB) was used to prepare our data file. First, all the files were put into the same folder. Next, one of the files was loaded into TPB. The multiple files option in TPB was used to load all the files together as a wildcard union:\r\nWildcard Union of all the filesAs the date of the files was recognised in the wrong locale, we go to the settings tab to change the date to UK format:\r\nChanging locale to United KingdomEach data file contained around 400 columns of data and each row of data comprised survey responses and survey respondent demographics. Only data with vaccine related questions (e.g. vac_1, vac2_1, vac3) as well as survey respondents’ demographics (e.g. gender, age) were retained. We excluded the other columns of data that were not used. The following columns were retained:\r\nColumns RetainedNext, a “clean” step was added. For cleaning, we first filter responses which were in 2021:\r\nFiltering data by dateNext, we renamed the file paths column as “Country”. We also renamed all the values e.g. australia.csv, singapore.csv to their proper country names e.g. Australia, Singapore by using title case and remove the .csv behind.\r\nRenaming CountryFinally, the prepared data was saved for further use in Tableau:\r\nOutput Data for use in Tableau2.4.2 Load Data\r\nWe first load the data in Tableau by dragging the exported .hyper file into Tableau.\r\nNext, we created groups for the Age, Household Size, and Household Children columns. This allowed us to present the data in an aggregated manner.\r\nGrouping for AgeGrouping for Household SizeGrouping for Household Children2.4.3 Creating Parameters\r\nA new sheet called “Survey Results” was created for the first visualisation. In order to allow interactivity for the visualisations, we create a few parameters.\r\nWe first create a parameter to let the viewer choose the survey question. This parameter will be used to control which survey question the visualisation will show the results for. We change the parameter data type to “String” and choose “List” for allowable values. We type in the various values and their corresponding questions in the list below. The questions to values mappings are gotten from the codebook excel spreadsheet included with the data.\r\nParameter for Survey QuestionWe created a corresponding calculated field to select the appropriate column of our data based on the choice of survey question.\r\nCalculated Field for Survey FieldNext, we create a parameter called “Show”. We change the parameter data type to “String” and choose “List” for allowable values. We type in the various values and their text to display in the list below. This will allow the viewer to select which elements to show for the visualisations, i.e. whether to show the Actual Mean, the 95% error bar, and/or the 99% error bar.\r\nParameter for ShowWe create a parameter called “Breakdown By” to allow the viewer to breakdown the results by various metrics. We change the parameter data type to “String” and choose “List” for allowable values. We type in the various values in the list below.\r\nParameter to Breakdown ByWe create a corresponding calculated field to select the appropriate column based on the viewer’s selection.\r\nCalculated Field for Breakdown FieldWe create a parameter “Agree Calculation” to allow the viewer to choose which survey responses to include when calculating the percentage of respondents who agree, i.e. whether to only use “Strongly Agree” or both “Strongly Agree” and “Agree”. We use the integer data type with values of “1” and “2” as these will be used in our formula to calculate the percentage.\r\nParameter for Agree CalculationLastly, we create two more parameters “Sort By” and “Sort Order” to allow the viewer to control the sorting. For “Sort By”, we use the string data type and allow the viewer to sort by either “Country” or “Value”. For “Sort Order”, we use the integer data type and use “1” for Ascending and “-1” for Descending. This will be used in a subsequent formula to control the sort order.\r\nParameter for Sort ByParameter for Sort OrderFinally, we right click on all the parameters and select “Show Parameter” to show them on the worksheet.\r\nSelect Show Parameter to add them to the worksheetParameters are added to the right of the worksheet2.4.4 Creating Fields for Percentage and Error Bars Visualisation\r\nNext, we create the various fields that will support the visualisation.\r\nWe create a calculated field called “Number of Respondents” and set the value to 1. This field will be used to count the number of respondents.\r\nCalculated Field for Number of RespondentsWe create a field called “Total Respondents”. This field will sum up the total number of respondents, excluding the aggregation at the “Country” level. This field will mainly be used for the title to show the total number of respondents.\r\nCalculated Field for Total RespondentsWe create a field called “Score”. This field will get the score of the data in integer ranging from 1 to 5. Note that the survey responses are “1 - Strongly Agree”, “2”, “3”, “4”, and “5 - Strongly Disagree”. Hence, we take the leftmost character of the response and convert it to integer to get the score.\r\nCalculated Field for ScoreNext, we create a field for the percentage of respondents who agree. This is computed by summing the people who meet the threshold set in the “Agree Calculation” parameter and dividing it by the number of respondents.\r\nCalculated Field for Percentage of Respondents who AgreeNext, we create a field for the overall average, without aggregation at the “Country” level. Similar to total respondents, this will be used for the title as well as the reference line.\r\nOverall Percentage of Respondents who AgreeNext, we create two constant fields for the 95% and 99% z score values of 1.959964 and 2.575829 respectively. These will be used to compute the 95% and 99% error bars.\r\nZ 95% Constant ValueZ 99% Constant ValueNext, we create a field for “Standard Error”. Standard error is computed using the following formula:\r\n\\[\\sqrt{\\frac{percentage * (1-percentage)}{sample size}}\\]\r\nThis is translated to the following calculated field:\r\nCalculated Field for Standard ErrorNext, we create the fields to get the margins of error for 95% and 99%. These are computed using the standard error multiplied by the respective z scores.\r\nCalculated field for 95% Margin of ErrorCalculated field for 99% Margin of ErrorNext, we created four calculated fields for the upper and lower values of both 95% and 99% confidence intervals.\r\nLower 99% ValueUpper 99% ValueLower 95% ValueUpper 95% ValueNext, we create the fields that will be used to display the elements on the visualisation. The “Show” parameter created earlier is used to control which elements to show. By checking if the parameter contains the various values, we show the relevant elements as appropriate.\r\nCalculated Field for Lower 99% with Show checkCalculated Field for Upper 99% with Show checkCalculated Field for Lower 95% with Show checkCalculated Field for Upper 95% with Show checkFinally, we create a field called “Sort Field” to control how we sort the elements on the graph. This field will use the “Sort Order” and “Sort By” parameters to decide whether to sort ascendingly or descendingly and by Country or by Value.\r\nCalculated Field to Determine Sorting2.4.5 Creating Fields for Divergent Stacked Bars Visualisation of Likert Scale Data\r\nWe next move on to create the fields required for the divergent stacked bars.\r\nWe create a calculated field to count the positive responses. Since our survey responses is on a scale of 1 to 5, with 1 being strongly agree and 5 being strongly disagree, we count the number of 1 and 2 and half of responses of 3.\r\nCalculated Field for Count PositiveSimilarly, we create a field to count the negative responses. We use -1 and -0.5 respectively for negative and neutral responses so that the bars will be towards to left of 0.\r\nCalculated Field for Count NegativeWe create a field called “Positive Percentages” to get the percentages for positive responses. This uses the positive count as the numerator and the number of respondents for the denominator. We exclude “Score” from the level of detail as we need to get the total number of respondents and not just respondents for each score.\r\nCalculated Field for Positive PercentagesWe similarly create one for the negative responses called “Negative Percentages”.\r\nCalculated Field for Negative Percentages2.4.5 Creating Survey Results Visualisation\r\nWe first add the “% Agree” field to the Columns shelf and the “Country” field to the Rows shelf and change the mark to circle to display the % who agree as a circle on the visualisation.\r\nAdding the fields and changing the markWe adjust the x-axis to be fixed from 0 to 1, with tick marks at intervals of 0.1. We also change the format for the x-axis to be in percentage with no decimal places by right-clicking on the axis and formatting it.\r\nChanging Axis Range from 0 to 1Changing Axis Tick Marks to be in 0.1 intervalsFormatting the AxisChanging to Percentage FormatWe drag “Measure Values” to the Columns shelf. We remove the irrelevant measures from the “Measure Values” shelf, leaving only the Upper/Lower 95%/99% values. We also sort them by dragging the 99% values on top.\r\nDefault Measure Values when we drag to the Row ShelfFinal Measure ValuesWe change the axes to dual axis and synchronise the axes by right-clicking on the second axis and selecting the appropriate option.\r\nChanging to Dual AxisSynchronising the AxisWe change the “Measure Names” from detail to colour.\r\nChanging from Detail to ColourWe click on the “Colour” icon and change the colours of the 99% values to light grey and 95% values to a darker grey.\r\nChanging ColoursWe change the mark type to “Line” and drag “Measure Names” from the left pane to the path icon.\r\nChange marks to LineWe go back to the previous AGG(% Agree) mark and change its colour to blue.\r\nChange Mark to BlueSince the mark for % Agree appears behind the error bars, we right-click on the axis and move the mark to the front.\r\nMove mark to frontWe set the number of format for “% Agree”, “Upper 99%”, “Lower 99%”, “Upper 95%” and “Lower 95%” to percentage by holding “Ctrl” and select them before right-clicking on it on the left pane. We then set the number format to percentage with 0 decimal places.\r\nChanging Number Format for % AgreeChanging to Percentage with 0 decimal placesWe add “% Agree” to the rows shelf by dragging it from the left pane and change it from continuous to discrete. This allows us to display the % on the left axis.\r\nAdd % Agree to RowsChanging % Agree from Continuous to DiscreteSince we are using calculated fields to show or hide the error bars, we want to hide the indicator that shows that there are null values when we do not show the 95 or 99% error bars. We do this by going to “Analysis > Special Values > Hide”.\r\nHide Special ValuesWe also hide the top axis since both axes are synchronised. We do this by right-clicking on the top axis and unticking “Show Header”.\r\nHide the top axisTo implement our custom sort using our two parameters, we sort “Country” in the row shelf by right-clicking on it and choosing sort and using our “Sort Field” to sort it.\r\nChoosing the SortSettings for SortWe add another element to show the Grand Total by going to “Analysis > Totals > Show Column Totals” and also “Column Totals to Top”. This will show us the result for all survey respondents aggregated for all countries.\r\nGrand TotalsNext, we drag the “Overall % Agree” field to the detail icon of the “AGG(% Agree)” mark. This will allow us to get a reference line for the overall percentage of people who agree.\r\nOverall % AgreeWe add the reference line to the axis to show the overall percentage of people who agree. We also change the number format for Overall % Agree to percentage.\r\nOption to add reference lineReference Line optionsNext, we drag the “Total Respondents” field to the detail icon of “All” marks. This will allow us to use the total number of respondents in the title.\r\nAdd Total Respondents to DetailWe add a meaningful title to the visualisation by right-clicking on the title and then “Edit title”. The title will show the current survey question as well as the overall percent of respondents who agree and the total number of respondents.\r\nVisualisation TitleWe drag the “Number of Respondents” field to the tooltip icon of the All marks. This will allow us to use the number of respondents in the tooltips of the visualisation.\r\nAdding Number of Respondents to the tooltipWe add meaningful tooltips for % Agree and the Error Bars by clicking the tooltip option of the respective marks.\r\nTooltip for % AgreeTooltip for Error BarsWe scale the visualisation to “Entire View”.\r\nScale to Entire ViewWe add animation to the visualisation by going to “Format > Animations”. We set the animation to on and the duration to 1 second.\r\nTurning Animations OnFinally, we get the final visualisation for survey results as follows:\r\nVisualisation for Survey Results2.4.6 Creating Visualisation for further breakdown of results\r\nIn order to create another visualisation to breakdown the results, we duplicate the previous worksheet to minimise the number of steps required. We rename the duplicated sheet as “Breakdown of Results”.\r\nDuplicate the first visualisationSince we want to breakdown by another field instead of country, we replace “Country” in the rows shelf with “Breakdown Field” by dragging “Breakdown Field” onto “Country” in the rows shelf.\r\nReplacing Country with Breakdown FieldWe change the reference line to use the total of “% Agree”.\r\nEdit Reference LineReference Line for Breakdown VisualisationSince we no longer need the total respondents for this visualisation, we remove it from the detail.\r\nRemove Total RespondentsWe change the tooltips of % Agree and Error Bars to dynamically display the breakdown by field label:\r\nTooltip for % Agree of Breakdown VisualisationTooltip for Error Bars of Breakdown VisualisationWe add a new Action by going to “Worksheet > Actions”. We add a new filter action such that selecting a country on the first worksheet will drilldown the results in the second sheet.\r\nAdding ActionAction SettingsWe change the title to let the viewer know the field we are breaking down by and the country if selected.\r\nVisualisation TitleThe final visualisation for the breakdown is as follows:\r\nVisualisation for Breakdown of Results2.4.7 Creating Visualisation for Divergent Stacked Bars\r\nWe create a new worksheet titled “Likert Results” for the divergent stacked bars visualisation.\r\nWe first change the number format of “Negative Percentages” and “Positive Percentages” to percentage.\r\nChange Number FormatChange format to percentageNext, we drag “Negative Percentages” and “Positive Percentages” to the Columns shelf and “Country” to the Rows shelf.\r\nAdding Fields to Columns and RowsWe sort Country by the “Sort Field”, similar to what we did for our first visualisation.\r\nSort CountryWe drag “Score” to Colour to colour the bars by their score. As “Score” is recognised as a continous measure, we need to change it to a discrete dimension instead.\r\nAdding Score to ColourChanging Score to a Discrete DimensionNext, we change the Axes to dual axis by right-clicking on the Positive Percentages axis and clicking dual axis. We further synchronise the axes to make them consistent.\r\nChange to Dual AxisSynchronise AxisTableau has automatically added “Measure Names” to colour marks. We remove it as it is not required.\r\nRemove Measure Names from ColourWe change the mark type from “Automatic” to “Bar” since we want to show divergent stacked bars.\r\nChange to Bar typeWe change the colour for the bars to use contrasting colours for agree and disagree.\r\nChange ColoursChange Score ColoursAs the bars are not arranged correctly according to their scores, we have to sort the colours accordingly. We do this by right-clicking on the legend items and clicking sort. We manually arrange the colours to make sure the bars are sorted like how we want it.\r\nSort the BarsSort the Score manuallySince we are using dual axis, we hide the header for the top axis by right-clicking on it and unchecking “Show Header”\r\nHide the top axisWe add the Column Totals to the top by going to the Analysis Menu and clicking the respective options.\r\nAdd Column TotalsWe add the title and colour coding for the viewer to easily identify what each colour means.\r\nVisualisation TitleWe change the axis title to “% of Respondents”.\r\nChange Axis TitleWhile divergent stacked bars are useful for comparison across countries, it might not be that intuitive to compare across the responses for each country. Hence we create another worksheet titled “Likert Tooltip” that will contain the visualisation for the tooltip to allow the viewer to compare across the responses.\r\nFirst, we drag Score to the Columns shelf and “Number of Respondents” to the Rows shelf.\r\nAdd Score and Number of RespondentsSince Score is recognised as a continuous measure, we need to change it to a discrete dimension.\r\nChange Score to Discrete DimensionWe also want to change the number of respondents from an absolute value to a percentage of total. We can use a quick table calculation to achieve this.\r\nChange Number of Respondents to Percent of TotalWe want to colour the bars by the scores and so we drag “Scores” to the colours icon. Similarly, we have to change score to a discrete dimension.\r\nColour Bars by ScoreChange Score to Discrete DimensionWe want to add the % of respondents to the label of the graph. We drag “Number of Respondents” to the Label icon and use a quick table calculation to change it from an absolute value to percentage of total.\r\nLabel using Number of RespondentsChange Number of Respondents to percentage of totalWe want to give meaningful labels to the scores. We right click on “Score” in the Columns shelf and click Edit Aliases. We give the scores meaningful labels.\r\nEdit Score AliasesScore AliasesIn order to put the negative bars to the left and the positive bars to the right, we sort the “Score” in the Columns shelf in a descending order.\r\nSort ScoresSince we are using this worksheet as a tooltip, we hide the y axis and the title. We further scale the graph to fit the “Entire View”. The final tooltip is as follows:\r\nTooltip for Likert ResultsWe add the completed worksheet to the tooltip of the previous visualisation. Note that we have to filter by “Country” so that it will show all responses for the country.\r\nTooltip to include the worksheetThe final product of this visualisation is as follows:\r\nVisualisation for Likert Survey Results2.4.8 Combining it together into a Dashboard\r\nFinally, we create a Dashboard titled “Vaccine Survey Dashboard” to combine the visualisations. The following steps were done to create the dashboard:\r\nDrag all three worksheets to the dashboard area to their respective areas and drag the controls to the bottom right.\r\nDashboard Starting Layout\r\nWe remove “Measure Names” and “Score” legend from the bottom right.\r\nRemove Measure NamesRemove Score from Dashboard\r\nWe resize the areas for the various visualisation for aesthetic purposes.\r\nWe add the source and author information below.\r\nSince the filter action was created earlier, we need to adjust it to work for the dashboard. We adjust the action based on the filters below.\r\nChange the Filter Action\r\nThe final product of the proposed visualisation in the form of a dashboard is as follows:\r\nFinal Dashboard2.5 Major Observations\r\n\r\nDescribe three major observations revealed by the data visualisation prepared.\r\n\r\nUsing the proposed data visualisations, we can observe the following:\r\nMore people would like to adopt a “wait and see” approach for getting the vaccine. Comparing the responses for the question on whether they are willing to take the vaccine this week against whether they are willing to take the vaccine a year from now, the percentage of people who agree increased for all countries except for Germany. The overall percentage increased from 52.47% of respondents who were willing to get the vaccine immediately compared to 59.56% one year later.\r\nWillingness to take vaccine this weekWillingness to take one year from now\r\nOlder people were generally more willing to take the vaccine as compared to younger people. This could be due to the fact that they are less worried about potential side effects of the vaccine as compared to younger people. We can see from the image below that about 42% to 44% of younger people in various age groups within the 18 to 45 range wanted to get the vaccine once it was available, compared to 51% and 58% for the age groups 46 to 55 and 56 to 65 respectively. Finally, people aged 66 and above were most willing, as 72% of that age group agreed to it.\r\nOlder people more willing to take vaccine as compared to younger people\r\nFemales were more worried about the potential side effects of a COVID-19 compared to males. This can be seen from the results where the proportion of females in all countries exceeded the proportion of males who agreed that they were worried about the potential side effects. The figure below shows the overall difference, where 54% of females were worried compared to 42% of males.\r\nFemales vs Males worrying about side effects\r\nThe residents of Japan have less believe in their Government to provide them with an effective vaccine. This can be seen by the fact that despite 68% (highest among all countries) of them being worried about getting COVID-19, only 47% (2nd lowest among all countries) believe that their Government will provide them with an effective vaccine and 37% (3rd lowest among all countries) of them were willing to take a vaccine this week. This has also been observed in the following article Survey: Japanese less trusting of government in health crisis, which shows that the Japanese are less trusting of government in a health crisis.\r\n68% of Japanese worried about getting COVID-1947% of Japanese believe their Government will be able to provide them with an effective vaccine37% of Japanese were willing to take a vaccine this week\r\n3. Conclusion\r\nIn this post, we look at how to present vaccine survey data for various countries. We identify areas of improvement in terms of clarity and aesthetics for the chart and propose changes to improve the visualisation. We further added interactive elements to enhance viewers’ experience to analyse the data. We implemented the changes in Tableau and were able to arrive at more insights than the original visualisation.\r\n4. References\r\nWexler, S. (2018, August 20). Showing uncertainty in survey results. Retrieved February 15, 2021, from https://www.datarevelations.com/resources/showing-uncertainty/\r\nWilke, C. O. (2019). 16 Visualizing uncertainty. In Fundamentals of data visualization: A primer on making informative and compelling figures. Retrieved February 15, 2021, from https://clauswilke.com/dataviz/visualizing-uncertainty.html\r\nWexler, S. (2018, April 1). Rethinking the divergent stacked bar chart - placing the stronger views in the center. Retrieved February 15, 2021, from https://www.datarevelations.com/resources/rethinkingdivergent/\r\n\r\n\r\n\r\n",
    "preview": "https://va.moomookau.org/posts/2021-02-05-dataviz-makeover-2/images/03ProposedDashboard.png",
    "last_modified": "2021-02-20T14:17:48+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This post will be looking at Chart 6 Resident labour force by age in MOM's Report: Labour Force in Singapore 2019 to see if there are possible areas of improvement and come up with a proposed visualisation to improve on those areas.",
    "author": [
      {
        "name": "Amos Lau",
        "url": "https://bochup.work"
      }
    ],
    "date": "2021-01-22",
    "categories": [
      "DataVizMakeover"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nTask\r\nCritic\r\nSketch of Proposed Design\r\nProposed Data Visualisation\r\nStep-by-step Description\r\nData preparation\r\nLoad Data\r\nComparison of 2009 and 2019’s Population and Labour Breakdown\r\nComparing Breakdown of Labour Force by Age Group from 2009 to 2019\r\nCombining it together into a Dashboard\r\n\r\nMajor Observations\r\n\r\nConclusion\r\n\r\nIntroduction\r\nThis post will be looking at Chart 6 Resident labour force by age in MOM’s Report: Labour Force in Singapore 2019 to identify possible areas of improvement.\r\nOriginal VisualisationWe will also come up with a proposed design and implement in tableau. Next, a step-by-step guide will be provided for coming up with the proposed design. Finally, we will list down major observations that we are able to derive from the proposed design.\r\nTask\r\nThe tasks can be summarised as follows:\r\nCritic the existing visualisation\r\nSketch a proposed design\r\nImplement the proposed design\r\nProvide steps for replication of the proposed design\r\nMajor observations derived from the proposed design\r\nCritic\r\n\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\n\r\nIn terms of clarity, the following areas could be improved:\r\nThe statement above the graph uses age ranges like 55 & over and 25 to 54. However, the graph itself uses a more granular age range. This may be result in viewers having difficult to relate to the statement.\r\nThe statement above the graph refers to the Labour Force Participation Rate (LFPR), but this data is not captured within the graph. This may be confusing to the viewer as they may think the chart represents LFPR.\r\nThe line chart used may not be the best representation for the data as lines are usually used when dealing with continuous data to indicate changes or trends. Since the data presented is of categorical data, it may make more sense to use an alternative representation like a bar chart.\r\nThe lines that show the Median Age for both June 2009 and June 2019 is an attempt to show the relative position of the median. For example, the line for the median age for June 2009 is 1/4 way between the tick marks of 40-44. However, this may confuse the viewers as the x-axis is not meant to be continuous.\r\nIn terms of aesthetics, the following areas could be improved:\r\nThere is no y-axis for the graph, making it difficult for the viewer to know the value of the points.\r\nThe table below is a waste of ink as it is visually difficult for a viewer to compare the numbers.\r\nThe chart title is generic and could be changed to something more impactful so the viewer knows what is the message we want to convey.\r\nSketch of Proposed Design\r\n\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. The proposed alternative data visualisation must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\n\r\nThe following is a sketch of the proposed design:\r\nSketch of Proposed DesignThe proposed design comprises two charts. The chart on the left compare the resident labour force and resident population for the different age groups for 2009 and 2019. The stacked bar chart will show the absolute numbers of the resident labour force and the residents outside of labour force, with the total length of the bar chart giving the resident population. Using stacked bars will alow us to visualise how the resident labour force and total population has changed for 2009 and 2019.\r\nThe chart on the right will provide a 100% breakdown of the various age groups from 2009 to 2019. This will allow us to observe the trend over the years and see if there has been any shift in the composition.\r\nProposed Data Visualisation\r\n\r\nUsing Tableau, design the proposed data visualisation.\r\n\r\nProposed visualisationThe proposed data visualisation has been uploaded to Tableau Public and can be found here.\r\nStep-by-step Description\r\n\r\nProvide step-by-step description on how the data visualisation was prepared.\r\n\r\nThe following sections describe how the data visualisation was prepared.\r\nData preparation\r\nThe data used for the visualisations were gotten the Ministry of Manpower’s website at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx. Specifically, Table 5 Resident Labour Force Participation Rate by Age and Sex, 2009 – 2019 (June) and Table 7 Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 – 2019 (June) were used for our data visualisation.\r\nScreenshot of Table 5 download from MOM’s websiteThe data file was in Excel format, but had to be cleaned in Excel by removing the extra columns and excess rows. Both the files were then merged into a single csv file, with an additional column indicating the type where LFPR refers to the Labour Force Participation Rate and RLF refers to the Resident Labour Force:\r\nScreenshot of csv fileNext, the data was loaded into Tableau Prep Builder for further preparation.\r\nThe data was first pivoted to convert the individual year columns into a single column:\r\nIndividual year columns were pivoted and the resulting columns were named as Year and ValueNext, the data was unpivoted from the Data and Value columns to get 2 columns for LFPR and RLF:\r\nUnpivot dataA calculated field was created to get the Residents Outside Labour Force (ROLF):\r\n[RLF]/[LFPR]*(100-[LFPR])\r\nThe column on LFPR was no longer required and was deleted.\r\nNext, the table was pivoted on the RLF and ROLF columns and given meaningful names.\r\nPivot RLF and ROLF columnsFinally, the prepared data was saved for further use in Tableau:\r\nOutput data for use in TableauLoad Data\r\nThe prepared data was loaded in Tableau:\r\nData was loaded in TableauThe Age Group column was renamed to Age Group (Original). The renaming was done such that we can group this column to aggregate the data further. This will be elaborated on later.\r\nThe Year column was renamed to Date and a calculated field was calculated to extract the year as a numerical value:\r\nCreation of Year ColumnComparison of 2009 and 2019’s Population and Labour Breakdown\r\nWe first create a new Tableau worksheet to compare the population and labour breakdown of 2009 and 2019. The following steps were done to create the worksheet:\r\nDrag the Residents (Thousands) measure to the Column shelf.\r\nDrag the Age Group (Original) dimension to the Row shelf.\r\nWe further aggregate the data by grouping the age groups into 3 groups - 15 - 24, 25 - 55, and 55 & Over.\r\nFurther aggregate the Age Groups\r\nWe add the Year field into the Rows shelf after the Age Group field. Next, we change the year field to a Dimension instead of a Measure, and for it to be a discrete dimension since we only want to compare 2009 and 2019.\r\nWe add the Year field into the filter, make it into a Discrete Dimension, and filter the years 2009 and 2019.\r\nWe drag Age Group to the Colour icon to colour the bar charts by the different age groups.\r\nWe drag Type to the Detail icon, and change Detail to Colour in order to further colour the age groups by the Resident Labour Force (RLF) and the Residents Outside of Labour Force (ROLF).\r\nWe drag Resident (Thousands) to the Label icon to add a Label on the bar charts. We want to display the percentage breakdown of RLF and ROLF and so we use a “Percent of Total” quick table calculation. The calculation was computed using “Table (Across)”.\r\nWe sort according to Age Group (older groups on top) and Year (2019 on top).\r\nWe change the colour of the items, using 3 distinct colours for each age group and lighter and darker shades to differentiate the RLF and ROLF.\r\nLegend Colours\r\nWe resize the chart to make the bars thicker.\r\nWe annotate the chart to provide our insights.\r\nWe provide meaningful titles to the chart and the legend.\r\nThe final product of the worksheet is as follows:\r\nFinal Product of WorksheetComparing Breakdown of Labour Force by Age Group from 2009 to 2019\r\nNext we create a worksheet to compare the breakdown of labour force from 2009 to 2019. The following steps were done to create the worksheet:\r\nWe drag the Year field to the Columns shelf and change it to a discrete dimension.\r\nWe drag the Residents (Thousands) measure to the Rows shelf. As we want to show the % breakdown per year, we use a quick table calculation to calculate the % of total, computing it using Table (Down). We use the same column as the label for the bar graphs.\r\nWe drag the Type field to the Filters shelf. As we want to only show the breakdown for the labour force, we filter by RLF type.\r\nWe drag Age Group to the Colours icon to colour the bar charts by age group.\r\nWe sort the stacked bars by Age Group with the youngest being below and oldest on top.\r\nWe change the colours to make them consistent with our previous worksheet.\r\nWe annotate the chart to provide our insights.\r\nWe provide meaningful titles to the chart, y-axis and the legend.\r\nThe final product of the worksheet is as follows:\r\nBreakdown of Resident Labour Force from 2009 to 2019Combining it together into a Dashboard\r\nFinally, we create a Dashboard to combine both charts. The following steps were done to create the worksheet:\r\nDrag both worksheets into the dashboard area.\r\nWe add texts the top and bottom of the dashboard for the title, description of the message we want the viewer to take away, and the sources used for the charts.\r\nThe final product of the proposed visualisation in the form of a dashboard is as follows:\r\nFinal Product of Proposed VisualisationMajor Observations\r\n\r\nDescribe three major observations revealed by the data visualisation prepared.\r\n\r\nUsing the proposed data visualisation, we can observe the following:\r\nThere are more older residents in the labour force in 2019 compared to 2009, both in terms of percentage and absolute value.\r\nThere are more total older residents, showing that people are living longer.\r\nThe percentage of older residents in the labour force has been increasing over the years, signalling an ageing workforce.\r\nConclusion\r\nIn this post, we look at MOM’s statement and chart describing how the median age of the workforce has shifted from 2009 to 2019. We identify areas of improvement in terms of clarity and aesthetics for the chart and propose changes to improve the visualisation. We implemented the changes in Tableau and were able to arrive at more insights than the original visualisation.\r\n\r\n\r\n\r\n",
    "preview": "https://va.moomookau.org/posts/2021-01-22-dataviz-makeover-1/images/13.%20Final%20Dashboard.png",
    "last_modified": "2021-02-20T14:17:30+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Amos' Visual Analytics Blog",
    "description": "Welcome to my blog. This blog was started for my masters module on Visual Analytics, and will be updated as and when I find other interesting things to write on.",
    "author": [
      {
        "name": "Amos Lau",
        "url": "https://www.linkedin.com/in/amos-lau/"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-02T06:55:19+08:00",
    "input_file": {}
  }
]
